export const Pattern01 = ({ to, title, sender, date, time, link }) => ({
  to,
  subject: '[Administrator] ได้รับบทความใหม่',
  content: `<p>&emsp;มีบทความใหม่ เรื่อง <b>${title}</b> โดย <b>${sender}</b> เมื่อวันที่ <b>${date}</b> เวลา ${time} โดยสามารถตรวจสอบบทความได้จาก <a href="${link}" target="_blank">${link}</a></p>`,
});

export const Pattern02 = ({ to, title, sender, link }) => ({
  to,
  subject: 'บทความของท่านกำลังเข้าสู่กระบวนการพิจารณา',
  content: `
  <p>เรียน&nbsp;${sender}</p>
  <p>&emsp;ตามที่ท่านได้มีความประสงค์เสนอบทความเรื่อง <b>${title}</b> เพื่อตีพิมพ์ในวารสารไทยศึกษานั้น บัดนี้คณะดำเนินการวารสารไทยศึกษาได้รับบทความของท่านเป็นที่เรียบร้อยแล้ว และจะดำเนินการตามกระบวนการพิจารณาต่อไป โดยระยะเวลาในการดำเนินการใช้เวลา 2-4 เดือน และท่านสามารถตรวจสอบรายละเอียดเพิ่มเติมได้จาก ${link}</p>
  <p>&emsp;ทั้งนี้ทางคณะผู้ดำเนินการวารสารขอแจ้งให้ทราบว่า เมื่อบทความของท่านได้รับพิจารณาตีพิมพ์ลงวารสาร ท่านจะต้องปรับรูปแบบรายการอ้างอิงเป็นภาษาอังกฤษตามรูปแบบของ ACI โดยคณะดำเนินการวารสารจะแจ้งรายละเอียดให้ท่านทราบต่อไป หากท่านมีข้อสงสัยเพิ่มเติมโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544</p>
  <p>&nbsp;</p>
  <p>ขอแสดงความนับถือ</p>
  <p>คณะดำเนินการวารสารไทยศึกษา<br />สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern03 = ({ to, title, sender }) => ({
  to,
  subject: 'บทความของท่านยังไม่ผ่านการพิจารณา',
  content: `
  <p>เรียน&nbsp;${sender}</p>
  <p>&emsp;ตามที่ท่านได้มีความประสงค์เสนอบทความเรื่อง <b>${title}</b> เพื่อตีพิมพ์ในวารสารไทยศึกษานั้น คณะดำเนินการวารสารไทยศึกษาได้รับบทความของท่านเป็นที่เรียบร้อยแล้ว และขอแจ้งให้ทราบว่า บทความของท่านไม่ตรงกับวัตถุประสงค์และขอบเขตของวารสารไทยศึกษา</p>
  <p>&emsp;วารสารไทยศึกษาหวังเป็นอย่างยิ่งว่าในโอกาสต่อไป วารสารไทยศึกษาจะมีโอกาสเป็นสื่อกลางในการเผยแพร่ผลงานทางวิชาการของท่านต่อไป</p>
  <p>&nbsp;</p>
  <p>ขอแสดงความนับถือ</p>
  <p>คณะดำเนินการวารสารไทยศึกษา<br />สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern04 = ({ to, title, reader, link, date }) => ({
  to,
  subject: 'ขอเชิญพิจารณาบทความวิจัย',
  content: `
  <p>เรียน&nbsp;${reader}</p>
  <p>&emsp;ด้วยสถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย กำลังดำเนินงานจัดทำวารสารไทยศึกษาเพื่อเผยแพร่ผลงานวิจัยด้านไทย-ไทศึกษา ในลักษณะสหวิทยาการ และเป็นสื่อกลางแลกเปลี่ยนความคิดเห็นทางวิชาการด้านไทย-ไทศึกษา</p>
  <p>&emsp;เพื่อให้บทความวิจัยที่ตีพิมพ์ในวารสารไทยศึกษามีคุณภาพทางวิชาการและเป็นแหล่งอ้างอิงทางด้าน ไทย–ไทศึกษา สถาบันไทยศึกษาจึงขอความกรุณาให้ท่านพิจารณาบทความเรื่อง <b>${title}</b></p>
  <p>&emsp;ทั้งนี้ ทางคณะดำเนินงานวารสารขอความอนุเคราะห์จากท่านเข้าประเมินบทความดังกล่าวได้ที่เว็บไซต์ <a href="${link}" target="_blank">${link}</a> และเมื่อท่านประเมินบทความเสร็จสิ้นแล้ว ขอความอนุเคราะห์จากท่านส่งใบสำคัญรับเงินสถาบันไทยศึกษาพร้อมแนบสำเนาบัตรประจำตัวประชาชน มาที่ กองบรรณาธิการสถาบันไทยศึกษา ชั้น 9 อาคารประชาธิปก-รำไพพรรณี จุฬาลงกรณ์มหาวิทยาลัย กรุงเทพฯ 10330 หากท่านมีข้อสงสัยเพิ่มเติมโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544</p>
  <p>&emsp;จึงเรียนมาเพื่อโปรดพิจารณาดำเนินการและขอความกรุณาประเมินบทความดังกล่าวภายในวันที่ <b>${date}</b> จักเป็นพระคุณยิ่ง</p>
  <p>&nbsp;</p>
  <p>ขอแสดงความนับถือ</p>
  <p>คณะดำเนินการวารสารไทยศึกษา<br />สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern05 = ({ to, title, reader, link }) => ({
  to,
  subject: 'ขอความอนุเคราะห์ประเมินบทความ',
  content: `
    <p>เรียน ${reader}</p>
    <p>ตามที่ทางคณะดำเนินงานวารสารไทยศึกษาได้เรียนเชิญให้ท่านพิจารณาบทความเรื่อง <b>${title}</b> เพื่อตีพิมพ์ลงในวารสารไทยศึกษานั้น</p>
    <p>บัดนี้ใกล้ครบกำหนดเวลาในการพิจารณาบทความแล้ว ขอความกรุณาท่านเข้าประเมินบทความดังกล่าวได้ที่เว็บไซต์ <a href="${link}" target="_blank">${link}</a> และเมื่อท่านประเมินบทความเสร็จสิ้นแล้ว ขอความอนุเคราะห์จากท่านส่งใบสำคัญรับเงินสถาบันไทยศึกษาพร้อมแนบสำเนาบัตรประจำตัวประชาชน มาที่ กองบรรณาธิการสถาบันไทยศึกษา ชั้น 9 อาคารประชาธิปก-รำไพพรรณี จุฬาลงกรณ์มหาวิทยาลัย กรุงเทพฯ 10330 หากท่านมีข้อสงสัยเพิ่มเติมโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544</p>
    <p>จึงเรียนมาเพื่อโปรดพิจารณาดำเนินการประเมินบทความดังกล่าวตามวันที่กำหนดจักเป็นพระคุณยิ่ง</p>
    <p>&nbsp;</p>
    <p>ขอแสดงความนับถือ</p>
    <p>คณะดำเนินการวารสารไทยศึกษา<br />สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern06 = ({ to, title, reader, link }) => ({
  to,
  subject: 'ขอความอนุเคราะห์ส่งผลการพิจารณาบทความ',
  content: `
    <p>เรียน ${reader}</p>
    <p>ตามที่ทางคณะดำเนินงานวารสารไทยศึกษาได้เรียนเชิญให้ท่านพิจารณาบทความเรื่อง <b>${title}</b> เพื่อตีพิมพ์ลงในวารสารไทยศึกษานั้น</p>
    <p>บัดนี้ครบกำหนดเวลาในการพิจารณาบทความแล้ว ขอความกรุณาท่านเข้าประเมินบทความดังกล่าวได้ที่เว็บไซต์ <a href="${link}" target="_blank">${link}</a> และเมื่อท่านประเมินบทความเสร็จสิ้นแล้ว ขอความอนุเคราะห์จากท่านส่งใบสำคัญรับเงินสถาบันไทยศึกษาพร้อมแนบสำเนาบัตรประจำตัวประชาชน มาที่ กองบรรณาธิการสถาบันไทยศึกษา ชั้น 9 อาคารประชาธิปก-รำไพพรรณี จุฬาลงกรณ์มหาวิทยาลัย กรุงเทพฯ 10330 หากท่านมีข้อสงสัยเพิ่มเติมโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544</p>
    <p>จึงเรียนมาเพื่อโปรดพิจารณาดำเนินการประเมินบทความดังกล่าวให้แล้วเสร็จจักเป็นพระคุณยิ่ง</p>
    <p>&nbsp;</p>
    <p>ขอแสดงความนับถือ</p>
    <p>คณะดำเนินการวารสารไทยศึกษา<br />สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern07_1 = ({ to, title, reader, date, link }) => ({
  to,
  subject: '[Administrator] ผู้อ่านส่งความคิดเห็นแล้ว',
  content: `
    <p><b>${reader}</b> ส่งความคิดเห็นของบทความเรื่อง <b>${title}</b> เรียบร้อยแล้วเมื่อวันที่ <b>${date}</b> โดยสามารถตรวจสอบบทความได้จาก <a href="${link}" target="_blank">${link}</a></p>
  `,
});

export const Pattern07_2 = ({ to, title, reader }) => ({
  to,
  subject: 'ได้รับผลการพิจารณาบทความเรียบร้อยแล้ว',
  content: `
    <p>เรียน ${reader}</p>
    <p>ตามที่ทางคณะดำเนินงานวารสารไทยศึกษาได้เรียนเชิญให้ท่านพิจารณาบทความเรื่อง <b>${title}</b> เพื่อตีพิมพ์ลงในวารสารไทยศึกษานั้น</p>
    <p>บัดนี้ทางคณะดำเนินงานวารสารไทยศึกษาได้รับผลการพิจารณาบทความของท่านเรียบร้อยแล้ว ทั้งนี้ ทางคณะดำเนินงานฯ ขอขอบพระคุณท่านเป็นอย่างสูงที่ให้ความอนุเคราะห์ในการพิจารณาบทความดังกล่าว และหวังเป็นอย่างยิ่งว่าจะได้รับความอนุเคราะห์จากท่านในโอกาสต่อไป</p>
    <p>&nbsp;</p>
    <p>ขอแสดงความนับถือ</p>
    <p>คณะดำเนินการวารสารไทยศึกษา<br />สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern08 = ({ to, title, sender, date, link, link2 }) => ({
  to,
  subject: 'แจ้งผลการพิจารณาบทความ',
  content: `<p>เรียน ${sender}</p>
  <p>&emsp;ตามที่ท่านได้ส่งบทความเรื่อง <b>${title}</b> เพื่อขอพิจารณาตีพิมพ์ในวารสารไทยศึกษานั้น บัดนี้ผู้ทรงคุณวุฒิได้พิจารณาบทความของท่านเรียบร้อยแล้ว 
  โดยท่านสามารถตรวจสอบผลการพิจารณาบทความดังกล่าวได้ที่เว็บไซต์ ${link}</p>
  <p>&emsp;อีกทั้งคณะดำเนินงานวารสารไทยศึกษาใคร่ขอความร่วมมือให้ท่านปรับรูปแบบการอ้างอิงตามแนวทางที่วารสารกำหนด เนื่องจากวารสารกำลังจะเข้าฐานข้อมูลระดับอาเซียน (ACI) 
  ซึ่งมีข้อกำหนดให้บทความต้องมีรูปแบบการอ้างอิงภาษาอังกฤษ โดยมีหลักการดังนี้</p>
  <p>รายการอ้างอิงท้ายบทความที่ผู้เขียนส่งให้คณะดำเนินงานโปรดทำเป็น 2 ไฟล์แยกดังต่อไปนี้</p>
  <ol><li><b>รายการอ้างอิงภาษาอังกฤษ</b> ใส่ท้ายบทความต่อจากบทสรุป เรียงลำดับ A-Z โดยจัดให้อยู่ในรูปแบบต่อไปนี้ นามสกุลผู้แต่ง, ชื่อต้นใส่เฉพาะตัวอักษรตัวแรก. (ปีที่พิมพ์). ชื่อหนังสือ (ถอดเสียงโดยใช้โปรแกรม Thai Romanization โดยสามารถเข้าถึงได้จาก http://pioneer.chula.ac.th/~awirote/resources/thai-romanization.html) [ชื่อหนังสือภาษาไทย ชื่อหนังสือที่แปลเป็นภาษาอังกฤษ ]. (พิมพ์ครั้งที่). เมืองที่พิมพ์: สำนักพิมพ์.</li></ol>
  <ol><li><b>รายการอ้างอิงภาษาไทย</b> (เพื่อใส่ในภาคผนวกด้านหลัง สำหรับผู้อ่านที่ต้องการสืบค้นรายชื่อหนังสือภาษาไทย) <b>เรียงตามลำดับให้เหมือนกับรายการอ้างอิงภาษาอังกฤษ</b></li></ol>
  <p>&emsp;จึงเรียนมาเพื่อโปรดพิจารณาปรับปรุงแก้ไขตามที่เห็นสมควรและอัปโหลดไฟล์บทความลงบนเว็บไซต์ ${link} <b>ภายในวันที่ ${date}</b> เพื่อดำเนินการตามขั้นตอนต่อไป โดยท่านสามารถศึกษาคู่มือการทำรายการอ้างอิงเพิ่มเติมและตัวอย่างบทความที่ได้รับการตีพิมพ์แล้วจากเว็บไซต์ ${link2} หากท่านมีข้อสงสัยโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544
  <p>&emsp;</p>
  <p>&emsp;</p>
  <p>ขอแสดงความนับถือ</p>
  <p>คณะดำเนินงานวารสารไทยศึกษา</br>สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  </p>

  `,
});

export const Pattern09 = ({ to, title, sender, link }) => ({
  to,
  subject: 'แจ้งผลการพิจารณาบทความ',
  content: `<p>เรียน ${sender}</p>
  <p>&emsp;ตามที่ท่านได้มีความประสงค์เสนอบทความเรื่อง <b>${title}</b> เพื่อตีพิมพ์ในวารสารไทยศึกษานั้น บัดนี้ผู้ทรงคุณวุฒิได้พิจารณาบทความของท่านเรียบร้อยแล้ว และขอแจ้งให้ทราบว่า 
  บทความของท่าน <b>ยังไม่ผ่านเกณฑ์การพิจารณาตีพิมพ์ลงวารสารไทยศึกษา</b> โดยท่านสามารถตรวจสอบรายละเอียดเพิ่มเติมได้จาก ${link} หากท่านมีข้อสงสัยเพิ่มเติมโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล 
  ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544
  </p>
  <p>&emsp;</p>
  <p>&emsp;</p>
  <p>ขอแสดงความนับถือ</p>
  <p>คณะดำเนินงานวารสารไทยศึกษา</br>สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern10_1 = ({ to, title, sender, date, link }) => ({
  to,
  subject: '[Administrator] ผู้เขียนส่งบทความที่ได้รับการแก้ไขแล้ว',
  content: `<p>&emsp;<b>${sender}</b> ส่งบทความที่ได้รับการแก้ไขเรื่อง <b>${title}</b> เรียบร้อยแล้วเมื่อวันที่ <b>${date}</b> โดยสามารถตรวจสอบได้จาก ${link}</p>
  `,
});

export const Pattern10_2 = ({ to, sender, title }) => ({
  to,
  subject: 'ได้รับบทความที่ฉบับแก้ไขแล้ว',
  content: `<p>เรียน ${sender}</p>
  <p>&emsp;ตามที่ท่านได้มีความประสงค์เสนอบทความเรื่อง <b>${title}</b> เพื่อตีพิมพ์ในวารสารไทยศึกษานั้น บัดนี้คณะดำเนินการวารสารไทยศึกษาได้รับบทความฉบับแก้ไขของท่านเป็นที่เรียบร้อยแล้ว 
  และจะดำเนินการตามกระบวนการต่อไป หากท่านมีข้อสงสัยเพิ่มเติมโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544</p>
  <p>&emsp;</p>
  <p>&emsp;</p>
  <p>ขอแสดงความนับถือ</p>
  <p>คณะดำเนินงานวารสารไทยศึกษา</br>สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern11 = ({ to, title, reader, date, link }) => ({
  to,
  subject: 'ขอเชิญพิจารณาบทความวิจัยที่ได้รับการแก้ไขแล้ว',
  content: `<p>เรียน ${reader}</p>
  <p>&emsp;ตามที่สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย ได้รับความอนุเคราะห์จากท่านในการพิจารณาบทความเรื่อง <b>${title}</b> 
  เพื่อตีพิมพ์ลงในวารสารไทยศึกษา โดยท่านได้ลงความเห็นว่า ควรตีพิมพ์บทความดังกล่าว โดยขอให้ปรับปรุงแก้ไขก่อนนั้น บัดนี้ผู้เขียนบทความดังกล่าวได้ทำการปรับปรุงแก้ไขบทความตามข้อเสนอแนะของท่านเป็นที่เรียบร้อยแล้ว</p>
  <p>&emsp;ทางคณะดำเนินการวารสารจึงใคร่ขอความกรุณาจากท่านพิจารณาบทความดังกล่าวอีกครั้งหนึ่งได้ที่เว็บไซต์ ${link} และเมื่อท่านพิจารณาบทความเสร็จสิ้นแล้ว ขอความอนุเคราะห์จากท่าน 
  <b>ส่งใบสำคัญรับเงินสถาบันไทยศึกษาพร้อมแนบสำเนาบัตรประจำตัวประชาชน</b> มาที่ <b>กองบรรณาธิการสถาบันไทยศึกษา ชั้น 9 อาคารประชาธิปก-รำไพพรรณี จุฬาลงกรณ์มหาวิทยาลัย กรุงเทพฯ 10330</b> 
  หากท่านมีข้อสงสัยเพิ่มเติมโปรดติดต่อ ดร.รัชนีกร รัชตกรตระกูล ผู้จัดการวารสารไทยศึกษา ที่หมายเลข 02-218-7494 หรือ 081-404-5544
  </p>
  <p>&emsp;จึงเรียนมาเพื่อโปรดพิจารณาดำเนินการและขอความกรุณาประเมินบทความดังกล่าว <b>ภายในวันที่ ${date}</b> จักเป็นพระคุณยิ่ง </p>
  <p>&emsp;</p>
  <p>&emsp;</p>
  <p>ขอแสดงความนับถือ</p>
  <p>คณะดำเนินงานวารสารไทยศึกษา</br>สถาบันไทยศึกษา จุฬาลงกรณ์มหาวิทยาลัย</p>
  `,
});

export const Pattern12 = ({ to, title, sender, date, time, link }) => ({
  to,
  subject: '[Administrator] มีการเคลื่อนไหวใหม่จากบทความ',
  content: `<p>มีการเคลื่อนไหวจากบทความเรื่อง <b>${title}</b> โดย <b>${sender}</b> เมื่อวันที่ <b>${date}</b> เวลา ${time} โดยสามารถตรวจสอบได้จาก ${link}</p>
  `,
});